app/Controllers/noticias_Controller.php

SELECT *
FROM `noticias`
---
    public function listar_noticias() {
        $noticias_model = new noticias_Model();

        $data['noticias'] = $noticias_model->findAll();

SELECT *
FROM `noticias`
WHERE `noticias`.`id_noticia` = '13'
---
    public function ver_noticia($id_noticia)
{
    $noticias_model = new noticias_Model();
    $noticia = $noticias_model->find($id_noticia);

SELECT *
FROM `noticias`
WHERE `noticia_estado` = 1
SELECT *
FROM `noticias`
WHERE `id_noticia` = '20'
 LIMIT 1
---
        public function editar_noticia($id=null){
            $noticias_model = new noticias_Model();
            $data['noticia']=$noticias_model->where ('noticia_estado', 1)->findAll();

            $data['noticia']=$noticias_model->where('id_noticia', $id)->first();

SELECT *
FROM `noticias`
WHERE `id_noticia` = '20'
 LIMIT 1
---
        public function editar_noticia_validacion(){
            $noticias_model = new noticias_Model();

            $validation = \Config\Services::validation();
            $request = \Config\Services::request();

            $id = $this->request->getPost('id_noticia');

            $noticia = $noticias_model->where('id_noticia', $id)->first();

UPDATE `noticias` SET `titulo` = 'Corriente del Niño: el pico máximo llegaría entre diciembre y enero', `autor` = 'Claudia Gomez', `fecha` = '2023-11-01', `copete` = 'El climatólogo Eduardo Sierra, explicó que la región se encuentra en el comienzo de un ciclo de humedad, que tendría picos de inundación entre marzo y abril. ', `cuerpo` = 'Eduardo Sierra, reconocido climatólogo, contó que se vienen manifestando en la región los efectos de la Corriente del Niño desde el mes de junio. Comentó que el calentamiento del agua en el Océano Pacífico genera el aumento de las precipitaciones y puntualmente en la región del litoral se espera que alcance el pico máximo hacia los meses de diciembre o enero.Señaló que los efectos en la zona de la cuenca alta y media del Río Paraná en este año se dieron “de forma tardía” por la extensión de “La Niña”, que se extendieron por tres años seguidos con sequia e incendios. Recordó que esto pertenece a un ciclo que se viene dando hace 9 años y suele tardar entre 10 y 11 años.Alerta en Ituzaingó por la creciente: más de 50 familias evacuadasRecordó que “en promedio, se dan tres años húmedos, donde se inunda todo, luego varios años intermedios y después tres años secos”. En este caso, Sierra dijo que “empezó tarde, pero se potencia y se perfila con crecientes en el Paraná, Iguazú y s', `imagen` = '1698806064_479e6e52348bf714455f.jpg', `noticia_estado` = 1
WHERE `noticias`.`id_noticia` IN ('20')
---
                    ];

                    $noticia = new noticias_Model();
                    $noticia->update($id,$data);

SELECT *
FROM `noticias`
WHERE `noticia_estado` = 1
SELECT *
FROM `noticias`
WHERE `id_noticia` = '13'
 LIMIT 1
UPDATE `noticias` SET `noticia_estado` = '0'
WHERE `noticias`.`id_noticia` IN ('13')
---
            public function eliminar_noticia($id=null){
                $noticias_model = new noticias_Model();
                $data['noticia']=$noticias_model->where ('noticia_estado', 1)->findAll();

                $data['noticia']=$noticias_model->where('id_noticia', $id)->first();

                $data= array('noticia_estado'=>'0');
                $noticia = new noticias_Model();
                $noticia->update($id, $data);