app/Controllers/usuario_Controller.php

SELECT *
FROM `usuarios`
---
public function listar_usuarios(){
    $usuario_model = new usuarios_Model();
    $data ['usuarios']=$usuario_model->findAll();

SELECT *
FROM `usuarios`
WHERE `usuario` = 'bricdiaz'
 LIMIT 1
---
public function auth()
{
    $session = session();
    $model = new usuarios_Model();

    //traemos los datos del formulario
    $usuario = $this->request->getVar('usuario');
    $password = $this->request->getVar('pass');

    //se verifica si el usuario ingresado en el formulario coincide con el de la tabla en la bd
    $data = $model->where('usuario', $usuario)->first();

SELECT *
FROM `usuarios`
WHERE `estado` = 1
SELECT *
FROM `usuarios`
WHERE `id` = '2'
 LIMIT 1
---
public function editar_usuario($id=null) {
    $usuarios_model = new usuarios_Model();
    $data['usuario']=$usuarios_model->where ('estado', 1)->findAll();

    $data['usuario']=$usuarios_model->where('id', $id)->first();

SELECT *
FROM `usuarios`
WHERE `id` = '2'
 LIMIT 1
---
    public function update(){
        $usuarios_model = new usuarios_Model();

        $validation = \Config\Services::validation();
        $request = \Config\Services::request();

        $id = $this->request->getPost('id');

        $usuario = $usuarios_model->where('id', $id)->first();

UPDATE `usuarios` SET `nombre` = 'Maria', `apellido` = 'Gomez', `correo` = 'maria@gmail.com', `usuario` = 'mariagomez', `estado` = 1
WHERE `usuarios`.`id` IN ('2')
---
                    ];

                    $usuario = new usuarios_Model();
                    $usuario->update($id,$data);